CSI API ETABS v1

# cFrameObjSetLateralBracing Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetLateralBracing(
    	string Name,
    	int MyType,
    	int Loc,
    	double MyDist1,
    	double MyDist2,
    	bool RelDist = true,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetLateralBracing (
    	Name As String,
    	MyType As Integer,
    	Loc As Integer,
    	MyDist1 As Double,
    	MyDist2 As Double,
    	Optional RelDist As Boolean = true,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim MyType As Integer
    Dim Loc As Integer
    Dim MyDist1 As Double
    Dim MyDist2 As Double
    Dim RelDist As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetLateralBracing(Name,
    	MyType, Loc, MyDist1, MyDist2, RelDist,
    	ItemType)

    int SetLateralBracing(
    	String^ Name,
    	int MyType,
    	int Loc,
    	double MyDist1,
    	double MyDist2,
    	bool RelDist = true,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetLateralBracing :
            Name : string *
            MyType : int *
            Loc : int *
            MyDist1 : float *
            MyDist2 : float *
            ?RelDist : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _RelDist = defaultArg RelDist true
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

MyType

    Type: SystemInt32

Loc

    Type: SystemInt32

MyDist1

    Type: SystemDouble

MyDist2

    Type: SystemDouble

RelDist (Optional)

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com